Тест_ЗУП_31_КОРП/src/Catalogs/МероприятияОбученияРазвития/МероприятияОбученияРазвития.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МероприятияОбученияРазвития</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВАрхиве</name>
    <comment>Помещено в архив</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМероприятия</name>
    <type>
      <types>CatalogRef.ВидыМероприятияОбученияРазвития</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПроведения</name>
    <comment>Внутренний/внешний</comment>
    <type>
      <types>EnumRef.СпособыПроведенияМероприятийОбученияРазвития</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбучениеСОтрывомОтПроизводства</name>
    <comment>Внутренний/внешний</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУчебныхЧасов</name>
    <comment>Длительность курса в часах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСлушателей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведения</name>
    <comment>Место проведения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособОпределенияСтоимости</name>
    <type>
      <types>EnumRef.СпособыРасчетаСуммыРасходовНаПерсонал</types>
    </type>
  </attributes>
  <attributes>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчебноеЗаведение</name>
    <type>
      <types>CatalogRef.УчебныеЗаведения</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокументаОбОбразовании</name>
    <comment>Вид выдаваемого документа после обучения</comment>
    <type>
      <types>CatalogRef.ВидыДокументовОбОбразовании</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрисваиваемаяСпециальность</name>
    <comment>Присваиваемая специальность</comment>
    <type>
      <types>CatalogRef.КлассификаторСпециальностейПоОбразованию</types>
    </type>
  </attributes>
  <attributes>
    <name>Квалификация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаЗачета</name>
    <type>
      <types>CatalogRef.ФормыЗачетаМероприятийОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаключатьУченическийДоговор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтветственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйКурс</name>
    <type>
      <types>CatalogRef.ЭлектронныеКурсы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьКомпетенции</name>
    <attributes>
      <name>Компетенция</name>
      <type>
        <types>CatalogRef.КомпетенцииПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ХарактеристикиПерсонала</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Обязательства</name>
    <attributes>
      <name>ПериодРаботы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Enums/СпособыПроведенияМероприятийОбученияРазвития/СпособыПроведенияМероприятийОбученияРазвития.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПроведенияМероприятийОбученияРазвития</name>
  <comment>Типы обучения</comment>
  <enumValues>
    <name>ВнутреннееМероприятие</name>
  </enumValues>
  <enumValues>
    <name>ВнешнееМероприятие</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныйКурс</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Catalogs/МероприятияОбученияРазвития/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если СпособПроведения <> Перечисления.СпособыПроведенияМероприятийОбученияРазвития.ВнешнееМероприятие Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "УчебноеЗаведение");
	КонецЕсли;
	
	Если СпособПроведения <> Перечисления.СпособыПроведенияМероприятийОбученияРазвития.ЭлектронныйКурс Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ЭлектронныйКурс");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
